

//================================= Задача 3 ====================================
// Задача 3.З використанням замикань розробити ітератор, тобто функцію, що буде поступово за окремими викликами видавати по одне значення від заданого мінімального до заданого максимального. Якщо значення досягне максимального, то наступним буде мінімальне значення. З використанням цієї функції реалізувати перебір номерів місяців. 

function createCounter(minV,maxV) {
	let month = minV
	function counterMonth() {
		if(month > maxV) month = minV
		return month++
	}
	return counterMonth
}


let test = createCounter(1,12)

 for (let i = 0; i < 20; i++) {
	document.write(`<span>${test()},</span>`)
 }


